src/cf/DataProcessors/ор_ГрупповаяЗагрузкаДанныхИзЭлектронныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ор_ГрупповаяЗагрузкаДанныхИзЭлектронныхДокументов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ор_НастройкиГрупповойЗагрузкиДанныхИзЭлектронныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_НастройкиГрупповойЗагрузкиДанныхИзЭлектронныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействияСФайлами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогПеремещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроводитьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пометка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НастройкаЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ор_ИсторияЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_ИсторияЗагрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЗагружаемогоФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ор_СтатусыОшибок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФоноваяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НумераторСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ор_СтатусыОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ор_СтатусыОшибок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Замечание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сообщение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/ор_ГрупповаяЗагрузкаДанныхИзЭлектронныхДокументов/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ЗавершитьЗагрузку;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьКЭШЗагрузок();
	ЗаполнитьТаблицуНастроек();
	ТаблицаНастроек.Сортировать("Наименование");
	НастройкиСохранены = Истина;
	
	// Установка пустых значений отбора по периоду
	ИсторияЗагрузки.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Дата('00010101'));
	ИсторияЗагрузки.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ТекущаяДата()));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		
		ПоказатьПредупреждение(,НСтр("ru = 'Групповая загрузка данных из внешних файлов не поддерживается в веб-клиенте.'"));
		Отказ = ИСТИНА;
		Возврат;
		
	#КонецЕсли
	
	УстановитьОтборОшибок(Элементы.ТаблицаНастроек.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ НастройкиСохранены И ЗавершениеРаботы Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СохранитьТекущиеНастройки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаНастроекПометкаПриИзменении(Элемент)
	
	НастройкиСохранены = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборОшибок(Элементы.ТаблицаНастроек.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьЗамечанияПриИзменении(Элемент)
	
	УстановитьОтборОшибок(Элементы.ТаблицаНастроек.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьСообщенияПриИзменении(Элемент)
	
	УстановитьОтборОшибок(Элементы.ТаблицаНастроек.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьОтборДинамическогоСписка("Контрагент");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектОтбораПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		ИсторияЗагрузки,
		"Объект",
		ЭтотОбъект["ОбъектОтбора"],
		ЗначениеЗаполнено(ЭтотОбъект["ОбъектОтбора"]));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоФоновыеПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		ИсторияЗагрузки,
		"ФоноваяЗагрузка",
		ЭтотОбъект["ОтображатьТолькоФоновые"],
		ЗначениеЗаполнено(ЭтотОбъект["ОтображатьТолькоФоновые"]));
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ИсторияЗагрузки.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Период.ДатаНачала);
	ИсторияЗагрузки.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ?(ЗначениеЗаполнено(Период.ДатаОкончания), Период.ДатаОкончания, КонецДня(ТекущаяДата())));
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.ТаблицаФайлов.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		ИсторияЗагрузки,
		"НастройкаЗагрузки",
		ТекСтрока.НастройкаЗагрузки,
		ЗначениеЗаполнено(ТекСтрока.НастройкаЗагрузки));
		
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		ИсторияЗагрузки,
		"ИмяЗагружаемогоФайла",
		ТекСтрока.ИмяЗагружаемогоФайла,
		ЗначениеЗаполнено(ТекСтрока.ИмяЗагружаемогоФайла));
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОшибкиПриИзменении(Элемент)
	
	УстановитьОтборДинамическогоСписка("СтатусОшибки");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьЗначенияФлажков(Истина);
	НастройкиСохранены = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	УстановитьЗначенияФлажков(Ложь);
	НастройкиСохранены = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицу(Команда)
	
	ОбновитьКЭШЗагрузок();
	ЗаполнитьТаблицуНастроек();
	ТаблицаНастроек.Сортировать("Наименование");
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗавершитьЗагрузку = Истина;
	МассивСтрок = ТаблицаНастроек.НайтиСтроки(Новый Структура("Пометка", Истина));
	ВыполнитьЗагрузку(МассивСтрок,0,Неопределено,0);
	
	Если ЗавершитьЗагрузку Тогда
		ОбновлениеТаблицПослеЗагрузки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СохранитьТекущиеНастройки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновлениеТаблицПослеЗагрузки()
	
	УстановитьОтборОшибок(Элементы.ТаблицаНастроек.ТекущиеДанные);
	ОбновитьКЭШЗагрузок();
	ОбновитьСтатусыТаблицыНастроек();
	
КонецПроцедуры

// Процедура заполнения таблицы настроек из регистра сведений
//
&НаСервере
Процедура ЗаполнитьТаблицуНастроек()
	
	НаборЗаписей = РегистрыСведений.ор_НастройкиГрупповойЗагрузкиДанныхИзЭлектронныхДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	ТаблицаНастроек.Очистить();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		СтрокаТЗ = ТаблицаНастроек.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, Запись);
		
		СтруктураОтбораКЭШа = Новый Структура("Контрагент, НастройкаЗагрузки, Каталог", СтрокаТЗ.Контрагент, СтрокаТЗ.НастройкаЗагрузки, СтрокаТЗ.Каталог);
		МассивСтрок = КЭШЗагрузок.НайтиСтроки(СтруктураОтбораКЭШа);
		Если МассивСтрок.Количество()<>0 Тогда
			СтрокаТЗ.ДатаПоследнейЗагрузки = МассивСтрок[0].ДатаЗагрузки;
			Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ДатаНачалаЗагрузки) И НЕ ЗначениеЗаполнено(СтрокаТЗ.ДатаОкончанияЗагрузки) Тогда
				СтрокаТЗ.ДатаНачалаЗагрузки    = МассивСтрок[0].ДатаНачалаЗагрузки;
				СтрокаТЗ.ДатаОкончанияЗагрузки = МассивСтрок[0].ДатаЗагрузки;
			КонецЕсли;
		Иначе
			СтрокаТЗ.ДатаПоследнейЗагрузки = '00010101';
			СтрокаТЗ.ДатаНачалаЗагрузки    = '00010101';
			СтрокаТЗ.ДатаОкончанияЗагрузки = '00010101';
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьСтатусыТаблицыНастроек();
	
КонецПроцедуры

// Выполняет обновление статусов таблицы настроек
//
&НаСервере
Процедура ОбновитьСтатусыТаблицыНастроек()
	
	Для Каждого СтрокаТаблицы Из ТаблицаНастроек Цикл
		ОбновитьСтатусСтрокиТаблицыНастроек(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

// Выполняет обновление статусов в строке таблицы настроек
//
&НаСервере
Процедура ОбновитьСтатусСтрокиТаблицыНастроек(СтрокаТаблицы)
	
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбораКЭШа = Новый Структура("Контрагент, НастройкаЗагрузки, Каталог", СтрокаТаблицы.Контрагент, СтрокаТаблицы.НастройкаЗагрузки, СтрокаТаблицы.Каталог);
	МассивСтрок = КЭШЗагрузок.НайтиСтроки(СтруктураОтбораКЭШа);
	СтатусЗагрузки = 0;
	Если МассивСтрок.Количество()<>0 Тогда
		СтрокаТаблицы.ДатаПоследнейЗагрузки = МассивСтрок[0].ДатаЗагрузки;
		СтатусЗагрузки = МассивСтрок[0].СтатусОшибки;
		Если ЗначениеЗаполнено(МассивСтрок[0].ДатаНачалаЗагрузки) И ЗначениеЗаполнено(МассивСтрок[0].ДатаЗагрузки) Тогда
			СтрокаТаблицы.ДатаНачалаЗагрузки    = МассивСтрок[0].ДатаНачалаЗагрузки;
			СтрокаТаблицы.ДатаОкончанияЗагрузки = МассивСтрок[0].ДатаЗагрузки;
		КонецЕсли;
	Иначе
		СтрокаТаблицы.ДатаПоследнейЗагрузки = '00010101';
		СтрокаТаблицы.ДатаНачалаЗагрузки    = '00010101';
		СтрокаТаблицы.ДатаОкончанияЗагрузки = '00010101';
	КонецЕсли;
	
	Если СтатусЗагрузки = 1 Тогда
		СтрокаТаблицы.СтатусЗагрузкиЗначение = 0;
		СтрокаТаблицы.СтатусЗагрузки = Перечисления.ор_СтатусыОшибок.Ошибка;
	ИначеЕсли СтатусЗагрузки = 2 Тогда
		СтрокаТаблицы.СтатусЗагрузкиЗначение = 2;
		СтрокаТаблицы.СтатусЗагрузки = Перечисления.ор_СтатусыОшибок.Сообщение;
	Иначе
		СтрокаТаблицы.СтатусЗагрузкиЗначение = 5;
		СтрокаТаблицы.СтатусЗагрузки = Перечисления.ор_СтатусыОшибок.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает значение флагов "Пометка" таблицы настроек в соответствии
// с переданным значением
//
&НаКлиенте
Процедура УстановитьЗначенияФлажков(ЗначениеФлага)
	
	Для Каждого ТекСтрока Из ТаблицаНастроек Цикл
		ТекСтрока.Пометка = ЗначениеФлага;
	КонецЦикла;
	
КонецПроцедуры

// Выполняет загрузку данных в соответствии с таблицей настроек
//
&НаКлиенте
Процедура ВыполнитьЗагрузку(МассивСтрок, ИндексНачало1, МассивФайлов,ИндексНачало2)
	
	Для СЧ1 = ИндексНачало1 По МассивСтрок.Количество()-1 Цикл
		
		Каталог = МассивСтрок[СЧ1].Каталог;
		НастройкаЗагрузки = МассивСтрок[СЧ1].НастройкаЗагрузки;
		
		Каталог = СтрЗаменить(Каталог, "\", "/");
		МассивФайлов = Новый Массив;
		МассивРасширений = Новый Массив;
		МассивРасширений.Добавить("*.dbf");
		МассивРасширений.Добавить("*.xls");
		МассивРасширений.Добавить("*.txt");
		МассивРасширений.Добавить("*.mxl");
		МассивРасширений.Добавить("*.mdb");
		МассивРасширений.Добавить("*.sst");
		МассивРасширений.Добавить("*.mmo");
		МассивРасширений.Добавить("*.xml");
		МассивРасширений.Добавить("*.ods");
		Для Каждого Расширение Из МассивРасширений Цикл
			МассивФайловПоРасширению = НайтиФайлы(Каталог, Расширение, Ложь);
			Для Каждого Файл Из МассивФайловПоРасширению Цикл
				МассивФайлов.Добавить(Файл);
			КонецЦикла;
		КонецЦикла;
		
		Если МассивФайлов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСтрок[СЧ1].ДатаНачалаЗагрузки = ТекущаяДата();
		
		Настройки = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьНастройкуИзХранилища(НастройкаЗагрузки);
		
		// Получение данных из настроек
		ВерсияОбработки = СокрЛП(Настройки.Область("R1C5").Текст);
		ТекстВосстановленногоРежимаЗагрузки = СокрЛП(Настройки.Область("R2C5").Текст);
		РежимЗагрузки = 0;
		Если ТекстВосстановленногоРежимаЗагрузки = "в справочник" ИЛИ ТекстВосстановленногоРежимаЗагрузки = "" Тогда
			РежимЗагрузки = 0;
		ИначеЕсли ТекстВосстановленногоРежимаЗагрузки = "в табличную часть" ИЛИ ТекстВосстановленногоРежимаЗагрузки = "Х" Тогда
			Если ТекстВосстановленногоРежимаЗагрузки = "в табличную часть" Тогда
				ТекстОбъекта = СокрЛП(Настройки.Область("R3C5").Текст);
				Если Лев(ТекстОбъекта, 16) = "РегистрСведений." Тогда
					РежимЗагрузки = 2;
				Иначе
					РежимЗагрузки = 1;
				КонецЕсли;
			Иначе
				РежимЗагрузки = 1;
			КонецЕсли;
		ИначеЕсли ТекстВосстановленногоРежимаЗагрузки = "в регистр сведений" Тогда
			РежимЗагрузки = 2;
		КонецЕсли;
		
		// Формирование структуры логирования
		СтруктураПараметровЛогирования = Новый Структура();
		СтруктураПараметровЛогирования.Вставить("НастройкаЗагрузки",    НастройкаЗагрузки);
		СтруктураПараметровЛогирования.Вставить("ИмяЗагружаемогоФайла", "");
		СтруктураПараметровЛогирования.Вставить("ОбъектДляЛогирования", Неопределено);
		СтруктураПараметровЛогирования.Вставить("ФоноваяЗагрузка",      Ложь);
		СтруктураПараметровЛогирования.Вставить("Контрагент",           МассивСтрок[СЧ1].Контрагент);
		СтруктураПараметровЛогирования.Вставить("Каталог",              МассивСтрок[СЧ1].Каталог);
		СтруктураПараметровЛогирования.Вставить("ДатаНачалаЗагрузки",   МассивСтрок[СЧ1].ДатаНачалаЗагрузки);
		СтруктураПараметровЛогирования.Вставить("НумераторСообщений",   0);
		СтруктураПараметровЛогирования.Вставить("ЕстьОшибки",           Ложь);
		
		ОбъектЗагрузки          = Настройки.Область("R3C5").Текст;
		ИмяСправочника          = "";
		ИмяВидаРегистра         = "";
		СсылкаИсточника         = Неопределено;
		ТабличнаяЧастьИсточника = Неопределено;
		
		// Заполнение метаданных
		Попытка
			Если РежимЗагрузки = 0 Тогда
				// Загрузка в справочник
				ОбъектЗагрузки = СокрЛП(СтрЗаменить(ОбъектЗагрузки, "Справочник.", ""));
				ИмяСправочника = ОбъектЗагрузки;
				СсылкаИсточника = ПредопределенноеЗначение("Справочник."+ОбъектЗагрузки+".ПустаяСсылка");
				РежимЗагрузки = 3;
			ИначеЕсли РежимЗагрузки = 1 тогда
				// Загрузка в  документ
				ОбъектЗагрузки = СокрЛП(СтрЗаменить(ОбъектЗагрузки, "Документ.", ""));
				Попытка
					ИмяДокумента = Лев(ОбъектЗагрузки,Найти(ОбъектЗагрузки,".ТабличнаяЧасть")-1);
					СсылкаИсточника = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.СформироватьДокументГрупповаяЗагрузка(ИмяДокумента);
					ТабличнаяЧастьИсточника = СтрЗаменить(ОбъектЗагрузки,ИмяДокумента+".ТабличнаяЧасть.","");
					
					// Обновление данных структуры параметров логирования
					СтруктураПараметровЛогирования.Вставить("ОбъектДляЛогирования", СсылкаИсточника);
				Исключение
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ОписаниеОшибки(), 1, СтруктураПараметровЛогирования);
				КонецПопытки;
			ИначеЕсли РежимЗагрузки = 2 Тогда
				// Загрузка в регистр сведений
				ОбъектЗагрузки = СокрЛП(СтрЗаменить(ОбъектЗагрузки, "РегистрСведений.", ""));
				ИмяВидаРегистра = ОбъектЗагрузки;
			КонецЕсли;
		Исключение
			Продолжить;
		КонецПопытки;
		
		// Заполняем начальные данные структуры
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("СсылкаИсточника",         СсылкаИсточника);
		СтруктураПараметров.Вставить("РежимЗагрузки",           РежимЗагрузки);
		СтруктураПараметров.Вставить("ТабличнаяЧастьИсточника", ТабличнаяЧастьИсточника);
		СтруктураПараметров.Вставить("ИмяВидаРегистра",         ИмяВидаРегистра);
		СтруктураПараметров.Вставить("ИмяСправочника",          ИмяСправочника);
		СтруктураПараметров.Вставить("Поставщик",               МассивСтрок[СЧ1].Контрагент);
		
		// Первоначальная проверка параметров настройки. Если есть ошибки - дальше двигаться бесполезно.
		РезультатПроверкиНастройки = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ВыполнитьПроверкуНастройки(Настройки, НастройкаЗагрузки, СтруктураПараметров, СтруктураПараметровЛогирования);
		Если НЕ РезультатПроверкиНастройки Тогда
			Попытка
				ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.УдалитьДокументПриАвтоматическойЗагрузке(СсылкаИсточника);
				СсылкаИсточника = Неопределено;
			Исключение
			КонецПопытки;
			Продолжить;
		КонецЕсли;
		
		ВыполнитьЗагрузкуМассиваФайлов(СЧ1, МассивСтрок, МассивФайлов, НастройкаЗагрузки, Настройки, ОбъектЗагрузки, ИндексНачало2, РежимЗагрузки, СсылкаИсточника, СтруктураПараметров, СтруктураПараметровЛогирования, Файл);
		
		Если ЗавершитьЗагрузку Тогда
			УстановитьДатуИУдалитьДокумент(СЧ1, МассивСтрок, РежимЗагрузки, СсылкаИсточника);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуМассиваФайлов(Знач СЧ1, Знач МассивСтрок, Знач МассивФайлов, Знач НастройкаЗагрузки, Знач Настройки, ОбъектЗагрузки, Знач ИндексНачало2, Знач РежимЗагрузки, СсылкаИсточника, Знач СтруктураПараметров, СтруктураПараметровЛогирования, Знач Файл)
	
	Перем СЧ2, АдресВоВременномХранилище, ДокументНеПроведен, ЗагрузкаСОшибками, ИмяДокумента, ИнформацияОбОшибке, КаталогАрхиваПеремещаемыхФайлов, КоличествоЭлементов, СтрокаОшибки, ТабличныйДокумент;
	Удаляемые = Новый Массив;
	Для СЧ2=ИндексНачало2 По МассивФайлов.Количество()-1 Цикл
		Если НЕ МассивФайлов[СЧ2].Существует() ИЛИ МассивФайлов[СЧ2].ЭтоКаталог() Тогда
			ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог("Файл данных <"+МассивФайлов[СЧ2].Имя+"> не существует или является каталогом", 1, СтруктураПараметровЛогирования);
			Удаляемые.Добавить(СЧ2);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Значение Из Удаляемые Цикл
		МассивФайлов.Удалить(Значение);
	КонецЦикла;
	
	// разберемся с каждым файлом
	Для СЧ2=ИндексНачало2 По МассивФайлов.Количество()-1 Цикл
		
		ОбрабатываемыйФайл = МассивФайлов[СЧ2].Имя;
		ЭтотОбъект.ОбновитьОтображениеДанных();
		
		// Обновление данных структуры параметров логирования
		СтруктураПараметровЛогирования.Вставить("ИмяЗагружаемогоФайла", МассивФайлов[СЧ2].ПолноеИмя);
		СтруктураПараметровЛогирования.Вставить("ЕстьОшибки",           Ложь);
		
		ЗавершитьЗагрузку = Ложь;
		НачатьПомещениеФайлов(Новый ОписаниеОповещения("ВыполнитьЗагрузкуПомещениеФайловЗавершение", ЭтотОбъект, Новый Структура("СЧ1, СЧ2, ИнформацияОбОшибке, МассивСтрок, МассивФайлов, НастройкаЗагрузки, Настройки, ОбъектЗагрузки, РежимЗагрузки, СсылкаИсточника, СтруктураПараметров, СтруктураПараметровЛогирования, ТабличныйДокумент, Файл", СЧ1, СЧ2, ИнформацияОбОшибке, МассивСтрок, МассивФайлов, НастройкаЗагрузки, Настройки, ОбъектЗагрузки, РежимЗагрузки, СсылкаИсточника, СтруктураПараметров, СтруктураПараметровЛогирования, ТабличныйДокумент, Файл)),, МассивФайлов[СЧ2].ПолноеИмя,Ложь);
		Возврат;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуПомещениеФайловЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	АдресВоВременномХранилище = Результат[0].Хранение;
	
	СЧ1 = ДополнительныеПараметры.СЧ1;
	СЧ2 = ДополнительныеПараметры.СЧ2;
	ИнформацияОбОшибке = ДополнительныеПараметры.ИнформацияОбОшибке;
	МассивСтрок = ДополнительныеПараметры.МассивСтрок;
	МассивФайлов = ДополнительныеПараметры.МассивФайлов;
	НастройкаЗагрузки = ДополнительныеПараметры.НастройкаЗагрузки;
	Настройки = ДополнительныеПараметры.Настройки;
	ОбъектЗагрузки = ДополнительныеПараметры.ОбъектЗагрузки;
	РежимЗагрузки = ДополнительныеПараметры.РежимЗагрузки;
	СсылкаИсточника = ДополнительныеПараметры.СсылкаИсточника;
	СтруктураПараметров = ДополнительныеПараметры.СтруктураПараметров;
	СтруктураПараметровЛогирования = ДополнительныеПараметры.СтруктураПараметровЛогирования;
	ТабличныйДокумент = ДополнительныеПараметры.ТабличныйДокумент;
	Файл = ДополнительныеПараметры.Файл;
	
	ЗавершениеЗагрузкиФайлов(СЧ1, СЧ2, АдресВоВременномХранилище, ИнформацияОбОшибке, МассивСтрок, МассивФайлов, НастройкаЗагрузки, Настройки, ОбъектЗагрузки, РежимЗагрузки, СсылкаИсточника, СтруктураПараметров, СтруктураПараметровЛогирования, ТабличныйДокумент, Файл);
	СЧ2 = СЧ2+1;
	ЗавершитьЗагрузку = Истина;
	ВыполнитьЗагрузкуМассиваФайлов(СЧ1, МассивСтрок, МассивФайлов, НастройкаЗагрузки, Настройки, ОбъектЗагрузки, СЧ2, РежимЗагрузки, СсылкаИсточника, СтруктураПараметров, СтруктураПараметровЛогирования, Файл);
	
	Если ЗавершитьЗагрузку Тогда
		
		УстановитьДатуИУдалитьДокумент(СЧ1, МассивСтрок, РежимЗагрузки, СсылкаИсточника);
		СЧ1=СЧ1+1;
		ВыполнитьЗагрузку(МассивСтрок, СЧ1, МассивФайлов,0);
		
		Если ЗавершитьЗагрузку Тогда
			
			ОбновлениеТаблицПослеЗагрузки();
			ЗавершитьЗагрузку = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеЗагрузкиФайлов(Знач СЧ1, Знач СЧ2, Знач АдресВоВременномХранилище, ИнформацияОбОшибке, Знач МассивСтрок, Знач МассивФайлов, Знач НастройкаЗагрузки, Знач Настройки, ОбъектЗагрузки, Знач РежимЗагрузки, СсылкаИсточника, Знач СтруктураПараметров, СтруктураПараметровЛогирования, ТабличныйДокумент, Знач Файл)
	
	Перем ДокументНеПроведен, ЗагрузкаСОшибками, ИмяДокумента, КаталогАрхиваПеремещаемыхФайлов, КоличествоЭлементов, СтрокаОшибки;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Если СтруктураПараметров.ИспользоватьВнешнийМодульПреобразованияФайла И ЗначениеЗаполнено(СтруктураПараметров.ОбработкаПреобразования) Тогда
		ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ЗаполнитьТабличныйДокументИзXMLСервер(МассивФайлов[СЧ2], СтруктураПараметров.ОбработкаПреобразования, ТабличныйДокумент, АдресВоВременномХранилище, СтруктураПараметровЛогирования);
	Иначе
		ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПрочитатьТабличныйДокумент(ТабличныйДокумент, МассивФайлов[СЧ2].Расширение, МассивФайлов[СЧ2].ИмяБезРасширения, АдресВоВременномХранилище, СтруктураПараметров.Табуляция, СтруктураПараметров.Кодировка, СтруктураПараметровЛогирования);
	КонецЕсли;
	
	Если НЕ СтруктураПараметровЛогирования.ЕстьОшибки Тогда
		КоличествоЭлементов = ТабличныйДокумент.ВысотаТаблицы - СтруктураПараметров.ПерваяСтрокаДанныхТабличногоДокумента + 1;
		Если КоличествоЭлементов <= 0 Тогда
			ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог("В файле <"+МассивФайлов[СЧ2].Имя+"> нет данных для загрузки", 1, СтруктураПараметровЛогирования);
		Иначе
			// Выполним загрузку
			СтруктураПараметров.Вставить("СсылкаИсточника", СсылкаИсточника);
			ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ВыполнитьЗагрузкуИзТабличногоДокумента(ТабличныйДокумент, Настройки, НастройкаЗагрузки, СтруктураПараметров, СтруктураПараметровЛогирования);
			
			Если РежимЗагрузки = 1 тогда
				// Попробуем провести документ, который мы создали
				Если МассивСтрок[СЧ1].ПроводитьДокументы Тогда
					Попытка
						ДокументНеПроведен = Ложь;
						ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПровестиДокументПриАвтоматическойЗагрузке(СсылкаИсточника, ДокументНеПроведен);
						Если ДокументНеПроведен Тогда
							ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог("Документ """+СсылкаИсточника+""" не проведен", 2, СтруктураПараметровЛогирования);
						Иначе
							ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог("Документ """+СсылкаИсточника+""" проведен", 3, СтруктураПараметровЛогирования);
						КонецЕсли;
					Исключение
						ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог("Не удалось провести документ """+СсылкаИсточника+"""", 1, СтруктураПараметровЛогирования);
					КонецПопытки;
				КонецЕсли;
				
			КонецЕсли;
			
			Попытка
				Если МассивСтрок[СЧ1].ДействияСФайлами = 0 Тогда
					КаталогАрхиваПеремещаемыхФайлов = МассивСтрок[СЧ1].КаталогПеремещения+"\"+Строка(Формат(ТекущаяДата(),"ДФ=""дд-ММ-гггг"""));
					СоздатьКаталог(КаталогАрхиваПеремещаемыхФайлов);
					ПереместитьФайл(МассивФайлов[СЧ2].ПолноеИмя, КаталогАрхиваПеремещаемыхФайлов+"\"+МассивФайлов[СЧ2].Имя);
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог("Файл """+Файл.Имя+""" перемещен в каталог "+ КаталогАрхиваПеремещаемыхФайлов, 3, СтруктураПараметровЛогирования);
				ИначеЕсли МассивСтрок[СЧ1].ДействияСФайлами = 1 Тогда
					УдалитьФайлы(МассивФайлов[СЧ2].ПолноеИмя);
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог("Файл """+Файл.Имя+""" удален.", 3, СтруктураПараметровЛогирования);
				Иначе
					ЗагрузкаСОшибками = СтруктураПараметровЛогирования.ЕстьОшибки;
					Если НЕ ЗагрузкаСОшибками Тогда
						Если МассивСтрок[СЧ1].ДействияСФайлами = 3 Тогда
							КаталогАрхиваПеремещаемыхФайлов = МассивСтрок[СЧ1].КаталогПеремещения+"\"+Строка(Формат(ТекущаяДата(),"ДФ=""дд-ММ-гггг"""));
							СоздатьКаталог(КаталогАрхиваПеремещаемыхФайлов);
							ПереместитьФайл(МассивФайлов[СЧ2].ПолноеИмя,КаталогАрхиваПеремещаемыхФайлов+"\"+МассивФайлов[СЧ2].Имя);
							ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог("Файл """+Файл.Имя+""" перемещен в каталог "+ КаталогАрхиваПеремещаемыхФайлов, 3, СтруктураПараметровЛогирования);
						ИначеЕсли МассивСтрок[СЧ1].ДействияСФайлами = 4 Тогда
							УдалитьФайлы(МассивФайлов[СЧ2].ПолноеИмя);
							ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог("Файл """+Файл.Имя+""" удален.", 3, СтруктураПараметровЛогирования);
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				СтрокаОшибки ="Ошибка при выполнении действий с файлом после загрузки"+Символы.ПС+Символы.ПС;
				ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
				Пока ИнформацияОбОшибке<>Неопределено Цикл
					СтрокаОшибки = СтрокаОшибки+"   "+ИнформацияОбОшибке.Описание+Символы.ПС;
					ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
				КонецЦикла;
				ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(СтрокаОшибки, 1, СтруктураПараметровЛогирования);
			КонецПопытки;
			
			Если РежимЗагрузки = 1 тогда
				
				// Если грузим в документ, то надо создать новый документ для загрузки в него следующего файла
				ОбъектЗагрузки = СокрЛП(СтрЗаменить(ОбъектЗагрузки, "Документ.", ""));
				СтруктураПараметровЛогирования.Вставить("ОбъектДляЛогирования", Неопределено);
				Попытка
					ИмяДокумента = Лев(ОбъектЗагрузки,Найти(ОбъектЗагрузки,".ТабличнаяЧасть")-1);
					СсылкаИсточника = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.СформироватьДокументГрупповаяЗагрузка(ИмяДокумента);
					СтруктураПараметровЛогирования.Вставить("ОбъектДляЛогирования", СсылкаИсточника);
				Исключение
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ОписаниеОшибки(), 1, СтруктураПараметровЛогирования);
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	СтруктураПараметровЛогирования.ЕстьОшибки = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуИУдалитьДокумент(Знач СЧ1, Знач МассивСтрок, Знач РежимЗагрузки, СсылкаИсточника)
	
	ОбрабатываемыйФайл = "";
	
	Если РежимЗагрузки = 1 Тогда
		Попытка 
			ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.УдалитьДокументПриАвтоматическойЗагрузке(СсылкаИсточника);
			СсылкаИсточника = Неопределено;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	МассивСтрок[СЧ1].ДатаОкончанияЗагрузки = ТекущаяДата();
	
КонецПроцедуры

// Процедура обновления КЭШа загрузок
//
&НаСервере
Процедура ОбновитьКЭШЗагрузок()
	
	КЭШЗагрузок.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияЗагрузки.Контрагент КАК Контрагент,
	|	ИсторияЗагрузки.НастройкаЗагрузки КАК НастройкаЗагрузки,
	|	ИсторияЗагрузки.Каталог КАК Каталог,
	|	ИсторияЗагрузки.ДатаНачалаЗагрузки КАК ДатаНачалаЗагрузки,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ИсторияЗагрузки.СтатусОшибки = ЗНАЧЕНИЕ(Перечисление.ор_СтатусыОшибок.Ошибка)
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ) КАК СтатусОшибки,
	|	МАКСИМУМ(ИсторияЗагрузки.ДатаЗагрузки) КАК ДатаЗагрузки
	|ИЗ
	|	РегистрСведений.ор_ИсторияЗагрузки КАК ИсторияЗагрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияЗагрузки.Контрагент,
	|	ИсторияЗагрузки.НастройкаЗагрузки,
	|	ИсторияЗагрузки.Каталог,
	|	ИсторияЗагрузки.ДатаНачалаЗагрузки
	|ИТОГИ
	|	МАКСИМУМ(ДатаНачалаЗагрузки),
	|	МИНИМУМ(СтатусОшибки),
	|	МАКСИМУМ(ДатаЗагрузки)
	|ПО
	|	Контрагент,
	|	НастройкаЗагрузки,
	|	Каталог";
	
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКонтрагент.Следующий() Цикл
		ВыборкаНастройка = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНастройка.Следующий() Цикл
			ВыборкаКаталог = ВыборкаНастройка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКаталог.Следующий() Цикл
				НоваяСтрока = КЭШЗагрузок.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаКаталог);
				ВыборкаСтатусы = ВыборкаНастройка.Выбрать();
				Пока ВыборкаСтатусы.Следующий() Цикл
					Если НоваяСтрока.ДатаНачалаЗагрузки = ВыборкаСтатусы.ДатаНачалаЗагрузки Тогда
						НоваяСтрока.ДатаЗагрузки = ВыборкаСтатусы.ДатаЗагрузки;
						НоваяСтрока.СтатусОшибки = ВыборкаСтатусы.СтатусОшибки;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияЗагрузки.ИмяЗагружаемогоФайла КАК ИмяЗагружаемогоФайла,
	|	ИсторияЗагрузки.НастройкаЗагрузки КАК НастройкаЗагрузки,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ИсторияЗагрузки.СтатусОшибки = ЗНАЧЕНИЕ(Перечисление.ор_СтатусыОшибок.Ошибка)
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ) КАК СтатусЗагрузки
	|ИЗ
	|	РегистрСведений.ор_ИсторияЗагрузки КАК ИсторияЗагрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияЗагрузки.ИмяЗагружаемогоФайла,
	|	ИсторияЗагрузки.НастройкаЗагрузки";
	Выборка = Запрос.Выполнить().Выбрать();
	ТаблицаФайлов.Очистить();
	Пока Выборка.Следующий() Цикл
		НовСтр = ТаблицаФайлов.Добавить();
		НовСтр.НастройкаЗагрузки = Выборка.НастройкаЗагрузки;
		НовСтр.ИмяЗагружаемогоФайла = Выборка.ИмяЗагружаемогоФайла;
		НовСтр.Статус = Выборка.СтатусЗагрузки;
		Если Выборка.СтатусЗагрузки = 1 Тогда
			НовСтр.Статус = 0;
		ИначеЕсли Выборка.СтатусЗагрузки = 2 Тогда
			НовСтр.Статус = 2;
		Иначе
			НовСтр.Статус = 5;
		КонецЕсли;
		НовСтр.СтатусЗагрузки = ?(Выборка.СтатусЗагрузки = 1, Перечисления.ор_СтатусыОшибок.Ошибка, Перечисления.ор_СтатусыОшибок.Сообщение);
	КонецЦикла;
	
КонецПроцедуры

// Процедура установки отбора ошибок по текущей строке настройки
//
&НаКлиенте
Процедура УстановитьОтборОшибок(СтрокаТЗ)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		СписокОшибок,
		"НастройкаЗагрузки",
		?(СтрокаТЗ = Неопределено, ПредопределенноеЗначение("Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПустаяСсылка"), СтрокаТЗ.НастройкаЗагрузки),
		Истина);
	
	// Очистка отбора по дате
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("ДатаЗагрузки");
	КоллекцияЭлементов = СписокОшибок.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	КоличествоЭлементов = КоллекцияЭлементов.Количество();
	Для Номер = 1 По КоличествоЭлементов Цикл
		Индекс = КоличествоЭлементов - Номер;
		ЭлементОтбора = КоллекцияЭлементов[Индекс];
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			КоллекцияЭлементов.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
	// Установка отбора по дате
	УправлениеНебольшойФирмойКлиент.УстановитьЭлементОтбораСписка(СписокОшибок, "ДатаЗагрузки", ?(СтрокаТЗ = Неопределено, '00010101', СтрокаТЗ.ДатаНачалаЗагрузки), ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	УправлениеНебольшойФирмойКлиент.УстановитьЭлементОтбораСписка(СписокОшибок, "ДатаЗагрузки", ?(СтрокаТЗ = Неопределено, '00010101', СтрокаТЗ.ДатаОкончанияЗагрузки), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	
	// отбор по статусу сообщения
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.ор_СтатусыОшибок.Ошибка"));
	Если ВыводитьЗамечания Тогда
		СписокСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.ор_СтатусыОшибок.Замечание"));
	КонецЕсли;
	Если ВыводитьСообщения Тогда
		СписокСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.ор_СтатусыОшибок.Сообщение"));
	КонецЕсли;
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		СписокОшибок,
		"СтатусОшибки",
		СписокСтатусов,
		Истина,
		ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры

// Выполняет сохранение текущих настроек
//
&НаКлиенте
Процедура СохранитьТекущиеНастройки()
	
	Если НастройкиСохранены Тогда
		Возврат;
	КонецЕсли;
	
	Текст = НСтр("ru = 'Сохранить текущую таблицу настроек?'");
	Оповещение = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// Серверная часть процедуры сохранения настроек
//
&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	НаборЗаписей = РегистрыСведений.ор_НастройкиГрупповойЗагрузкиДанныхИзЭлектронныхДокументов.СоздатьНаборЗаписей();
	Для Каждого СтрокаТЗ Из ТаблицаНастроек Цикл
		НаборЗаписей.Отбор.Контрагент.Установить(СтрокаТЗ.Контрагент);
		НаборЗаписей.Отбор.НастройкаЗагрузки.Установить(СтрокаТЗ.НастройкаЗагрузки);
		НаборЗаписей.Отбор.Каталог.Установить(СтрокаТЗ.Каталог);
		НаборЗаписей.Прочитать();
		
		Запись = НаборЗаписей[0];
		Запись.Пометка = СтрокаТЗ.Пометка;
		НаборЗаписей.Записать();
	КонецЦикла;
	
	НастройкиСохранены = Истина;
	
КонецПроцедуры

// Процедура устанавливает отбор динамического списка формы.
//
&НаСервере
Процедура УстановитьОтборДинамическогоСписка(ИмяРеквизита)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ИсторияЗагрузки,
		ИмяРеквизита,
		ЭтотОбъект[ИмяРеквизита],
		ВидСравненияКомпоновкиДанных.Равно,,
		ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита]));
	
КонецПроцедуры // УстановитьОтборДинамическогоСписка()

// Обработка вопроса сохранения настроек.
//
// Параметры:
//  Результат - Структура - структура ответа.
//  Параметры - Структура - структура дополнительных параметров.
//
&НаКлиенте
Процедура СохранитьНастройкиЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьНастройкиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
